rottenpotatoes/app/controllers/movies_controller.rb

  def similar
    @movie = Movie.find(params[:movie_id]);
    if @movie.director.blank?
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'ff'

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "title" = 'The Help1', "updated_at" = '2016-11-23 03:10:23.043788' WHERE "movies"."id" = 4